tests/results-spike.txt
Test run id: th3gn_mc5awjjx774fpxxybx66d4fgw5c4c_ph9e
Phase started: unnamed (index: 0, duration: 10s) 00:10:31(-0500)

Phase completed: unnamed (index: 0, duration: 10s) 00:10:41(-0500)

Phase started: unnamed (index: 1, duration: 10s) 00:10:41(-0500)

--------------------------------------
Metrics for period to: 00:10:40(-0500) (width: 8.107s)
--------------------------------------

http.codes.200: ................................................................ 83
http.downloaded_bytes: ......................................................... 6557
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 83
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 89
  mean: ........................................................................ 7.1
  median: ...................................................................... 4
  p95: ......................................................................... 12.1
  p99: ......................................................................... 58.6
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 89
  mean: ........................................................................ 7.1
  median: ...................................................................... 4
  p95: ......................................................................... 12.1
  p99: ......................................................................... 58.6
http.responses: ................................................................ 83
vusers.completed: .............................................................. 83
vusers.created: ................................................................ 83
vusers.created_by_name.0: ...................................................... 83
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.2
  max: ......................................................................... 97.2
  mean: ........................................................................ 12.7
  median: ...................................................................... 7.2
  p95: ......................................................................... 32.1
  p99: ......................................................................... 76


Phase completed: unnamed (index: 1, duration: 10s) 00:10:51(-0500)

Phase started: unnamed (index: 2, duration: 10s) 00:10:51(-0500)

--------------------------------------
Metrics for period to: 00:10:50(-0500) (width: 9.723s)
--------------------------------------

http.codes.200: ................................................................ 700
http.downloaded_bytes: ......................................................... 55300
http.request_rate: ............................................................. 73/sec
http.requests: ................................................................. 700
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 15
  mean: ........................................................................ 3.4
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 10.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 15
  mean: ........................................................................ 3.4
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 10.9
http.responses: ................................................................ 700
vusers.completed: .............................................................. 700
vusers.created: ................................................................ 700
vusers.created_by_name.0: ...................................................... 700
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 33.4
  mean: ........................................................................ 5.4
  median: ...................................................................... 5
  p95: ......................................................................... 8.8
  p99: ......................................................................... 13.6


Phase completed: unnamed (index: 2, duration: 10s) 00:11:01(-0500)

--------------------------------------
Metrics for period to: 00:11:00(-0500) (width: 9.858s)
--------------------------------------

http.codes.200: ................................................................ 200
http.downloaded_bytes: ......................................................... 15800
http.request_rate: ............................................................. 21/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 17
  mean: ........................................................................ 3.7
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 13.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 17
  mean: ........................................................................ 3.7
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 13.9
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.0: ...................................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 20.3
  mean: ........................................................................ 5.6
  median: ...................................................................... 5.1
  p95: ......................................................................... 10.3
  p99: ......................................................................... 15.3


--------------------------------------
Metrics for period to: 00:11:10(-0500) (width: 1.317s)
--------------------------------------

http.codes.200: ................................................................ 17
http.downloaded_bytes: ......................................................... 1343
http.request_rate: ............................................................. 17/sec
http.requests: ................................................................. 17
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 38
  mean: ........................................................................ 6.5
  median: ...................................................................... 4
  p95: ......................................................................... 13.1
  p99: ......................................................................... 13.1
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 38
  mean: ........................................................................ 6.5
  median: ...................................................................... 4
  p95: ......................................................................... 13.1
  p99: ......................................................................... 13.1
http.responses: ................................................................ 17
vusers.completed: .............................................................. 17
vusers.created: ................................................................ 17
vusers.created_by_name.0: ...................................................... 17
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5.3
  max: ......................................................................... 41.7
  mean: ........................................................................ 9
  median: ...................................................................... 6.2
  p95: ......................................................................... 15.3
  p99: ......................................................................... 15.3


All VUs finished. Total time: 32 seconds

--------------------------------
Summary report @ 00:11:04(-0500)
--------------------------------

http.codes.200: ................................................................ 1000
http.downloaded_bytes: ......................................................... 79000
http.request_rate: ............................................................. 31/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 89
  mean: ........................................................................ 3.9
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 13.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 89
  mean: ........................................................................ 3.9
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 13.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 1000
vusers.created: ................................................................ 1000
vusers.created_by_name.0: ...................................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 97.2
  mean: ........................................................................ 6.1
  median: ...................................................................... 5.1
  p95: ......................................................................... 10.9
  p99: ......................................................................... 20.7